# Код Морзе для представления цифр и букв использует тире и точки.
# Напишите функцию для кодирования текстового сообщения в соответствии с кодом Морзе. (словари в помощь)
def morze (messege):
    messege_list = list(messege)
    dict_lett = {
        'a': '.-',
        'b': '-...',
        'c': '-.-.',
        'd': '-...',
        'e': '.',
        'f': '..-.',
        'h': '....',
        'i': '..',
        'j': '.---',
        'k': '-.-',
        'l': '.-..',
        'm': '--',
        'n': '-.',
        'o': '---',
        'p': '.--.',
        'q': '--.-',
        'r': '.-.',
        's': '...',
        't': '-',
        'u': '..-',
        'v': '...-',
        'w': '.---',
        'x': '-..-',
        'y': '-.--',
        'z': '--..',
        '0': '-----',
        '1': '.----',
        '2': '..---',
        '3': '...--',
        '4': '....-',
        '5': '.....',
        '6': '-....',
        '7': '--...',
        '8': '---..',
        '9': '----.'
    }
    for i in range(len(messege_list)):
        messege_list[i] = dict_lett.get(messege_list[i],'значения нет')
    messege = ''.join(messege_list)
    return messege

messege = input('Введите сообщение: ')
new_messege = morze(messege)
print(new_messege)

